# vstGetToolObject

## Description
THe installed vstSetPtBehavior might create an object with tool complete. vstGetToolObject returns this object

```pascal
FUNCTION vstGetToolObject : HANDLE;
```

```python

def vs.vstGetToolObject():
    return HANDLE
```

## Version
Availability: from Vectorworks 2011
## Category
* Tool Events